Tekla Open API Reference for Tekla Structures 2025
AnalysisPartPositionProperties.AxisModifierEnum Enumeration
 The axis modifiers.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum AxisModifierEnum
Public Enumeration AxisModifierEnum
Members
Member name | Value | Description
AXIS_MODIFIER_NONE | 0 |  The axis modifier is "none".
AXIS_MODIFIER_FIXED_COORDINATE | 1 |  The axis modifier is "fixed coordinate".
AXIS_MODIFIER_NEAREST_GRID | 2 |  The axis modifier is "nearest grid".
See Also
Reference
Tekla.Structures.Analysis Namespace